public class Identifier{

	public static void main(String args[]){

	}

/*
Identifier:
	1, 对各种变量，方法，类命名，接口名，包名等等的字符序列成为标识符
	2, 凡是自己起名的地方都可以叫标识符
定义规则：
	1, 26个字母，数字，_,$
	2, 数字不可以开头
	3，不可以用保留字
	4，严格区分大小写，无长度限制
	5，不能包含空格

命名规范：
	1，包名：组成字母全部小写
	2，类名：首字母大写，驼峰
	3，变量名方法名：首字母小写，之后单词首字母大写
	4，常量名：全部大写，多个单词用下划线连接

数据类型：
	基本数据类型：
		数值型：
			整数类型：byte(1字节)，short（2字节），int(4字节)，long(8字节)
			浮点类型：float(4字节，7位有效数字)，double(8字节，14位有效数字)
		字符型：char
		布尔型：boolean
	引用数据类型：
		类：class
		接口：interface
		数组：[]
	声明：long以l或者L结尾，不加L只用四个字节存，float以f或者F结尾，不加当成double则会报错
	char转义符：
		'\n'换行
		'\t'制表，tab
		'\b'退格
		'\r'回车
		'\"'，'\''引号
		'\\' \
	自动类型提升：
		int,long,float,double，按照表示的容量来算
		char，byte，short相互做运算结果都是int类型，如果变量与数字直接运算会编程int类型
	强制类型转换：
		需要使用强制类型转换符，可能导致精度损失

	前缀：二进制：0b，八进制0，十六进制0x
	计算机底层以补码存储数据
	char的初始化值是0或者‘/u0000’，有别于int
*/


}